Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_rfd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/cru.h
#define CRU_PB3DIVSET_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB3DIVSET) Register Mask  */


/* -------- CRU_PB3DIVINV : (CRU Offset: 0x15C) (R/W 32)  -------- */
#define CRU_PB3DIVINV_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB3DIVINV)   Reset Value */

#define CRU_PB3DIVINV_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB3DIVINV) Register Mask  */


/* -------- CRU_SLEWCON : (CRU Offset: 0x160) (R/W 32) SLEW RATE CONTROL FOR CLOCK SWITCHING REGISTER -------- */
#define CRU_SLEWCON_RESETVALUE                _UINT32_(0x00)                                       /*  (CRU_SLEWCON) SLEW RATE CONTROL FOR CLOCK SWITCHING REGISTER  Reset Value */

#define CRU_SLEWCON_BUSY_Pos                  _UINT32_(0)                                          /* (CRU_SLEWCON) Clock Switch Slewing Active Status Bit - Read-Only Position */
#define CRU_SLEWCON_BUSY_Msk                  (_UINT32_(0x1) << CRU_SLEWCON_BUSY_Pos)              /* (CRU_SLEWCON) Clock Switch Slewing Active Status Bit - Read-Only Mask */
#define CRU_SLEWCON_BUSY(value)               (CRU_SLEWCON_BUSY_Msk & (_UINT32_(value) << CRU_SLEWCON_BUSY_Pos)) /* Assigment of value for BUSY in the CRU_SLEWCON register */
#define   CRU_SLEWCON_BUSY_FINAL_Val          _UINT32_(0x0)                                        /* (CRU_SLEWCON) Clock Switch has reached its final value  */
#define   CRU_SLEWCON_BUSY_BUSY_Val           _UINT32_(0x1)                                        /* (CRU_SLEWCON) Clock frequency is being actively Slewed  */
#define CRU_SLEWCON_BUSY_FINAL                (CRU_SLEWCON_BUSY_FINAL_Val << CRU_SLEWCON_BUSY_Pos) /* (CRU_SLEWCON) Clock Switch has reached its final value Position  */
#define CRU_SLEWCON_BUSY_BUSY                 (CRU_SLEWCON_BUSY_BUSY_Val << CRU_SLEWCON_BUSY_Pos)  /* (CRU_SLEWCON) Clock frequency is being actively Slewed Position  */
#define CRU_SLEWCON_DNEN_Pos                  _UINT32_(1)                                          /* (CRU_SLEWCON) Clock slew enable for switching down to slower clocks Position */
#define CRU_SLEWCON_DNEN_Msk                  (_UINT32_(0x1) << CRU_SLEWCON_DNEN_Pos)              /* (CRU_SLEWCON) Clock slew enable for switching down to slower clocks Mask */
#define CRU_SLEWCON_DNEN(value)               (CRU_SLEWCON_DNEN_Msk & (_UINT32_(value) << CRU_SLEWCON_DNEN_Pos)) /* Assigment of value for DNEN in the CRU_SLEWCON register */
#define   CRU_SLEWCON_DNEN_DISABLED_Val       _UINT32_(0x0)                                        /* (CRU_SLEWCON) Clock Slewing disabled  */
#define   CRU_SLEWCON_DNEN_ENABLED_Val        _UINT32_(0x1)                                        /* (CRU_SLEWCON) Clock Slewing enabled on a clock switch  */
#define CRU_SLEWCON_DNEN_DISABLED             (CRU_SLEWCON_DNEN_DISABLED_Val << CRU_SLEWCON_DNEN_Pos) /* (CRU_SLEWCON) Clock Slewing disabled Position  */
#define CRU_SLEWCON_DNEN_ENABLED              (CRU_SLEWCON_DNEN_ENABLED_Val << CRU_SLEWCON_DNEN_Pos) /* (CRU_SLEWCON) Clock Slewing enabled on a clock switch Position  */
#define CRU_SLEWCON_UPEN_Pos                  _UINT32_(2)                                          /* (CRU_SLEWCON) Clock slew enable for switching up to faster clocks Position */
#define CRU_SLEWCON_UPEN_Msk                  (_UINT32_(0x1) << CRU_SLEWCON_UPEN_Pos)              /* (CRU_SLEWCON) Clock slew enable for switching up to faster clocks Mask */
#define CRU_SLEWCON_UPEN(value)               (CRU_SLEWCON_UPEN_Msk & (_UINT32_(value) << CRU_SLEWCON_UPEN_Pos)) /* Assigment of value for UPEN in the CRU_SLEWCON register */
#define   CRU_SLEWCON_UPEN_DISABLED_Val       _UINT32_(0x0)                                        /* (CRU_SLEWCON) Clock Slewing disabled  */
#define   CRU_SLEWCON_UPEN_ENABLED_Val        _UINT32_(0x1)                                        /* (CRU_SLEWCON) Clock Slewing enabled on a clock switch OR exit from SLEEP  */
#define CRU_SLEWCON_UPEN_DISABLED             (CRU_SLEWCON_UPEN_DISABLED_Val << CRU_SLEWCON_UPEN_Pos) /* (CRU_SLEWCON) Clock Slewing disabled Position  */
#define CRU_SLEWCON_UPEN_ENABLED              (CRU_SLEWCON_UPEN_ENABLED_Val << CRU_SLEWCON_UPEN_Pos) /* (CRU_SLEWCON) Clock Slewing enabled on a clock switch OR exit from SLEEP Position  */
#define CRU_SLEWCON_SLWDIV_Pos                _UINT32_(8)                                          /* (CRU_SLEWCON) Divisor steps used when doing slewed clock switches Position */
#define CRU_SLEWCON_SLWDIV_Msk                (_UINT32_(0x7) << CRU_SLEWCON_SLWDIV_Pos)            /* (CRU_SLEWCON) Divisor steps used when doing slewed clock switches Mask */
#define CRU_SLEWCON_SLWDIV(value)             (CRU_SLEWCON_SLWDIV_Msk & (_UINT32_(value) << CRU_SLEWCON_SLWDIV_Pos)) /* Assigment of value for SLWDIV in the CRU_SLEWCON register */
#define   CRU_SLEWCON_SLWDIV_NONE_Val         _UINT32_(0x0)                                        /* (CRU_SLEWCON) No Divisor used  */
#define   CRU_SLEWCON_SLWDIV_2_Val            _UINT32_(0x1)                                        /* (CRU_SLEWCON) Divide by 2, then no divisor  */
#define   CRU_SLEWCON_SLWDIV_4to2_Val         _UINT32_(0x2)                                        /* (CRU_SLEWCON) Divide by 4, then by 2, then no divisor  */
#define   CRU_SLEWCON_SLWDIV_8to2_Val         _UINT32_(0x3)                                        /* (CRU_SLEWCON) Divide by 8, then by 4, then by 2, then no divisor  */
#define   CRU_SLEWCON_SLWDIV_16to2_Val        _UINT32_(0x4)                                        /* (CRU_SLEWCON) Divide by 16, then by 8, then by 4, then by 2, then no divisor  */
#define   CRU_SLEWCON_SLWDIV_32to2_Val        _UINT32_(0x5)                                        /* (CRU_SLEWCON) Divide by 32, then by 16, then by 8, then by 4, then by 2, then no divisor  */
#define   CRU_SLEWCON_SLWDIV_64to2_Val        _UINT32_(0x6)                                        /* (CRU_SLEWCON) Divide by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor  */
#define   CRU_SLEWCON_SLWDIV_128to2_Val       _UINT32_(0x7)                                        /* (CRU_SLEWCON) Divide by 128, then by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor  */
#define CRU_SLEWCON_SLWDIV_NONE               (CRU_SLEWCON_SLWDIV_NONE_Val << CRU_SLEWCON_SLWDIV_Pos) /* (CRU_SLEWCON) No Divisor used Position  */
#define CRU_SLEWCON_SLWDIV_2                  (CRU_SLEWCON_SLWDIV_2_Val << CRU_SLEWCON_SLWDIV_Pos) /* (CRU_SLEWCON) Divide by 2, then no divisor Position  */
#define CRU_SLEWCON_SLWDIV_4to2               (CRU_SLEWCON_SLWDIV_4to2_Val << CRU_SLEWCON_SLWDIV_Pos) /* (CRU_SLEWCON) Divide by 4, then by 2, then no divisor Position  */
#define CRU_SLEWCON_SLWDIV_8to2               (CRU_SLEWCON_SLWDIV_8to2_Val << CRU_SLEWCON_SLWDIV_Pos) /* (CRU_SLEWCON) Divide by 8, then by 4, then by 2, then no divisor Position  */
#define CRU_SLEWCON_SLWDIV_16to2              (CRU_SLEWCON_SLWDIV_16to2_Val << CRU_SLEWCON_SLWDIV_Pos) /* (CRU_SLEWCON) Divide by 16, then by 8, then by 4, then by 2, then no divisor Position  */
#define CRU_SLEWCON_SLWDIV_32to2              (CRU_SLEWCON_SLWDIV_32to2_Val << CRU_SLEWCON_SLWDIV_Pos) /* (CRU_SLEWCON) Divide by 32, then by 16, then by 8, then by 4, then by 2, then no divisor Position  */
#define CRU_SLEWCON_SLWDIV_64to2              (CRU_SLEWCON_SLWDIV_64to2_Val << CRU_SLEWCON_SLWDIV_Pos) /* (CRU_SLEWCON) Divide by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor Position  */
#define CRU_SLEWCON_SLWDIV_128to2             (CRU_SLEWCON_SLWDIV_128to2_Val << CRU_SLEWCON_SLWDIV_Pos) /* (CRU_SLEWCON) Divide by 128, then by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor Position  */
#define CRU_SLEWCON_SYSDIV_Pos                _UINT32_(16)                                         /* (CRU_SLEWCON) PBx Peripheral Clock Divisor Control value Position */
#define CRU_SLEWCON_SYSDIV_Msk                (_UINT32_(0xF) << CRU_SLEWCON_SYSDIV_Pos)            /* (CRU_SLEWCON) PBx Peripheral Clock Divisor Control value Mask */
#define CRU_SLEWCON_SYSDIV(value)             (CRU_SLEWCON_SYSDIV_Msk & (_UINT32_(value) << CRU_SLEWCON_SYSDIV_Pos)) /* Assigment of value for SYSDIV in the CRU_SLEWCON register */
#define   CRU_SLEWCON_SYSDIV_DIV1_Val         _UINT32_(0x0)                                        /* (CRU_SLEWCON) Divide by 1- sys_clk_out same frequency as sys_clk source - Default  */
#define   CRU_SLEWCON_SYSDIV_DIV2_Val         _UINT32_(0x1)                                        /* (CRU_SLEWCON) Divide by 2- sys_clk_out is 1/2 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV3_Val         _UINT32_(0x2)                                        /* (CRU_SLEWCON) Divide by 3- sys_clk_out is 1/3 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV4_Val         _UINT32_(0x3)                                        /* (CRU_SLEWCON) Divide by 4- sys_clk_out is 1/4 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV5_Val         _UINT32_(0x4)                                        /* (CRU_SLEWCON) Divide by 5- sys_clk_out is 1/5 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV6_Val         _UINT32_(0x5)                                        /* (CRU_SLEWCON) Divide by 6- sys_clk_out is 1/6 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV7_Val         _UINT32_(0x6)                                        /* (CRU_SLEWCON) Divide by 7- sys_clk_out is 1/7 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV8_Val         _UINT32_(0x7)                                        /* (CRU_SLEWCON) Divide by 8- sys_clk_out is 1/8 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV9_Val         _UINT32_(0x8)                                        /* (CRU_SLEWCON) Divide by 9- sys_clk_out is 1/9 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV10_Val        _UINT32_(0x9)                                        /* (CRU_SLEWCON) Divide by 10- sys_clk_out is 1/10 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV11_Val        _UINT32_(0xA)                                        /* (CRU_SLEWCON) Divide by 11- sys_clk_out is 1/11 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV12_Val        _UINT32_(0xB)                                        /* (CRU_SLEWCON) Divide by 12- sys_clk_out is 1/12 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV13_Val        _UINT32_(0xC)                                        /* (CRU_SLEWCON) Divide by 13- sys_clk_out is 1/13 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV14_Val        _UINT32_(0xD)                                        /* (CRU_SLEWCON) Divide by 14- sys_clk_out is 1/14 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV15_Val        _UINT32_(0xE)                                        /* (CRU_SLEWCON) Divide by 15- sys_clk_out is 1/15 of sys_clk source  */
#define   CRU_SLEWCON_SYSDIV_DIV16_Val        _UINT32_(0xF)                                        /* (CRU_SLEWCON) Divide by 16- sys_clk_out is 1/16 of sys_clk source  */
#define CRU_SLEWCON_SYSDIV_DIV1               (CRU_SLEWCON_SYSDIV_DIV1_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 1- sys_clk_out same frequency as sys_clk source - Default Position  */
#define CRU_SLEWCON_SYSDIV_DIV2               (CRU_SLEWCON_SYSDIV_DIV2_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 2- sys_clk_out is 1/2 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV3               (CRU_SLEWCON_SYSDIV_DIV3_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 3- sys_clk_out is 1/3 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV4               (CRU_SLEWCON_SYSDIV_DIV4_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 4- sys_clk_out is 1/4 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV5               (CRU_SLEWCON_SYSDIV_DIV5_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 5- sys_clk_out is 1/5 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV6               (CRU_SLEWCON_SYSDIV_DIV6_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 6- sys_clk_out is 1/6 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV7               (CRU_SLEWCON_SYSDIV_DIV7_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 7- sys_clk_out is 1/7 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV8               (CRU_SLEWCON_SYSDIV_DIV8_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 8- sys_clk_out is 1/8 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV9               (CRU_SLEWCON_SYSDIV_DIV9_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 9- sys_clk_out is 1/9 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV10              (CRU_SLEWCON_SYSDIV_DIV10_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 10- sys_clk_out is 1/10 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV11              (CRU_SLEWCON_SYSDIV_DIV11_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 11- sys_clk_out is 1/11 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV12              (CRU_SLEWCON_SYSDIV_DIV12_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 12- sys_clk_out is 1/12 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV13              (CRU_SLEWCON_SYSDIV_DIV13_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 13- sys_clk_out is 1/13 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV14              (CRU_SLEWCON_SYSDIV_DIV14_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 14- sys_clk_out is 1/14 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV15              (CRU_SLEWCON_SYSDIV_DIV15_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 15- sys_clk_out is 1/15 of sys_clk source Position  */
#define CRU_SLEWCON_SYSDIV_DIV16              (CRU_SLEWCON_SYSDIV_DIV16_Val << CRU_SLEWCON_SYSDIV_Pos) /* (CRU_SLEWCON) Divide by 16- sys_clk_out is 1/16 of sys_clk source Position  */
#define CRU_SLEWCON_SLWDLY_Pos                _UINT32_(24)                                         /* (CRU_SLEWCON) Number of clocks generated at each slew step for a clock switch Position */
#define CRU_SLEWCON_SLWDLY_Msk                (_UINT32_(0xF) << CRU_SLEWCON_SLWDLY_Pos)            /* (CRU_SLEWCON) Number of clocks generated at each slew step for a clock switch Mask */
#define CRU_SLEWCON_SLWDLY(value)             (CRU_SLEWCON_SLWDLY_Msk & (_UINT32_(value) << CRU_SLEWCON_SLWDLY_Pos)) /* Assigment of value for SLWDLY in the CRU_SLEWCON register */
#define   CRU_SLEWCON_SLWDLY_1_Val            _UINT32_(0x0)                                        /* (CRU_SLEWCON) 1 clock will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_2_Val            _UINT32_(0x1)                                        /* (CRU_SLEWCON) 2 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_3_Val            _UINT32_(0x2)                                        /* (CRU_SLEWCON) 3 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_4_Val            _UINT32_(0x3)                                        /* (CRU_SLEWCON) 4 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_5_Val            _UINT32_(0x4)                                        /* (CRU_SLEWCON) 5 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_6_Val            _UINT32_(0x5)                                        /* (CRU_SLEWCON) 6 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_7_Val            _UINT32_(0x6)                                        /* (CRU_SLEWCON) 7 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_8_Val            _UINT32_(0x7)                                        /* (CRU_SLEWCON) 8 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_9_Val            _UINT32_(0x8)                                        /* (CRU_SLEWCON) 9 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_10_Val           _UINT32_(0x9)                                        /* (CRU_SLEWCON) 10 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_11_Val           _UINT32_(0xA)                                        /* (CRU_SLEWCON) 11 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_12_Val           _UINT32_(0xB)                                        /* (CRU_SLEWCON) 12 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_13_Val           _UINT32_(0xC)                                        /* (CRU_SLEWCON) 13 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_14_Val           _UINT32_(0xD)                                        /* (CRU_SLEWCON) 14 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_15_Val           _UINT32_(0xE)                                        /* (CRU_SLEWCON) 15 clocks will be generated at each slew step  */
#define   CRU_SLEWCON_SLWDLY_16_Val           _UINT32_(0xF)                                        /* (CRU_SLEWCON) 16 clocks will be generated at each slew step  */
#define CRU_SLEWCON_SLWDLY_1                  (CRU_SLEWCON_SLWDLY_1_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 1 clock will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_2                  (CRU_SLEWCON_SLWDLY_2_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 2 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_3                  (CRU_SLEWCON_SLWDLY_3_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 3 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_4                  (CRU_SLEWCON_SLWDLY_4_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 4 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_5                  (CRU_SLEWCON_SLWDLY_5_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 5 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_6                  (CRU_SLEWCON_SLWDLY_6_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 6 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_7                  (CRU_SLEWCON_SLWDLY_7_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 7 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_8                  (CRU_SLEWCON_SLWDLY_8_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 8 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_9                  (CRU_SLEWCON_SLWDLY_9_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 9 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_10                 (CRU_SLEWCON_SLWDLY_10_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 10 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_11                 (CRU_SLEWCON_SLWDLY_11_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 11 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_12                 (CRU_SLEWCON_SLWDLY_12_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 12 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_13                 (CRU_SLEWCON_SLWDLY_13_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 13 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_14                 (CRU_SLEWCON_SLWDLY_14_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 14 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_15                 (CRU_SLEWCON_SLWDLY_15_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 15 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_SLWDLY_16                 (CRU_SLEWCON_SLWDLY_16_Val << CRU_SLEWCON_SLWDLY_Pos) /* (CRU_SLEWCON) 16 clocks will be generated at each slew step Position  */
#define CRU_SLEWCON_Msk                       _UINT32_(0x0F0F0707)                                 /* (CRU_SLEWCON) Register Mask  */


/* -------- CRU_SLEWCONCLR : (CRU Offset: 0x164) (R/W 32)  -------- */
#define CRU_SLEWCONCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_SLEWCONCLR)   Reset Value */

#define CRU_SLEWCONCLR_Msk                    _UINT32_(0x00000000)                                 /* (CRU_SLEWCONCLR) Register Mask  */


